[
  {
    "slug": "planning-guest-list",
    "title": "Mastering Your Hindu Wedding Guest List",
    "date": "2024-07-30",
    "author": "SanskaraAI Planning Team",
    "excerpt": "Creating and managing the guest list for a Hindu wedding can be one of the most challenging aspects of planning. Here's how to approach it systematically.",
    "image": "/public/placeholder.svg",
    "contentMarkdown": "\n## The Art of the Invite: Navigating Your Hindu Wedding Guest List\n\nHindu weddings are often large, community-focused events, and managing the guest list can feel like a monumental task. Balancing family expectations, budget constraints, and venue capacity requires careful planning and communication. Here’s a step-by-step guide to help you master your guest list.\n\n### 1. Set a Preliminary Budget and Venue Capacity\nBefore you start listing names, have a frank discussion about your overall wedding budget. A significant portion of your expenses will be per head (catering, favors). Also, understand the maximum capacity of your chosen venues for different ceremonies. These two factors will heavily influence your guest list size.\n\n### 2. Create Initial Lists (Bride's Side, Groom's Side, Common)\nBoth families should create their initial lists of people they'd like to invite. It's helpful to categorize them:\n*   **A-List:** Immediate family, closest relatives, and dearest friends who *must* be invited.\n*   **B-List:** Extended family, other friends, colleagues, and parents' friends.\n*   **C-List (Optional):** Acquaintances or those you might invite if space and budget allow.\n\n### 3. Consolidate and Discuss\nCombine the lists from both sides. This is where negotiations and compromises often happen.\n*   **Identify Overlaps:** Remove duplicate entries.\n*   **Discuss Priorities:** If the combined list exceeds your target, discuss which categories or individuals are most crucial. It's important for both families to feel their key people are included.\n*   **The \"+1\" Rule:** Decide on your policy for plus-ones. Will all guests get one, or only those in long-term relationships?\n\n### 4. Factor in Multiple Events\nHindu weddings often involve multiple functions (e.g., Haldi, Mehndi, Sangeet, Wedding Ceremony, Reception). Decide if all guests will be invited to all events, or if some events will be more intimate. This can help manage numbers for specific functions.\n\n### 5. Use Guest List Management Tools\nManually tracking hundreds of guests, their contact details, RSVPs, dietary restrictions, and thank-you notes can be overwhelming. Utilize tools:\n*   **Spreadsheets:** Google Sheets or Excel can be a starting point.\n*   **Wedding Planning Apps/Software:** Platforms like SanskaraAI offer dedicated guest list management features, including RSVP tracking, digital invitations, and communication tools.\n\n### 6. Sending Invitations\n*   **Timeline:** Send invitations 6-8 weeks before the wedding for local guests, and earlier for out-of-town or international guests.\n*   **Information:** Clearly state who is invited (e.g., \"Mr. & Mrs. Sharma and family\" vs. \"Mr. & Mrs. Sharma\"). Include details for all functions, RSVP information (deadline and method), and any dress codes.\n*   **Digital vs. Physical:** While traditional printed invitations are beautiful, digital invitations (e-invites) are becoming increasingly popular for their convenience and cost-effectiveness, especially for pre-wedding events or save-the-dates.\n\n### 7. Tracking RSVPs\nThis is crucial for final headcount for caterers and seating arrangements. Follow up politely with guests who haven't responded by the deadline.\n\nManaging a Hindu wedding guest list is a marathon, not a sprint. Start early, communicate openly with your families, and use tools to stay organized. Remember, the goal is to celebrate with those who matter most to you while staying within your means.\n",
    "category": "Planning Insights",
    "tags": [
      "Guests",
      "Invitations",
      "Logistics",
      "Planning"
    ],
    "readTime": "4 min read",
    "calloutTitle": "Manage Your Guests with Ease!",
    "calloutText": "SanskaraAI offers tools to help you organize your guest list, track RSVPs, and manage communications seamlessly.",
    "calloutButtonText": "Explore Guest Management",
    "calloutButtonLink": "/dashboard/guests"
  },
  {
    "slug": "choosing-wedding-attire",
    "title": "Choosing Your Perfect Hindu Wedding Attire",
    "date": "2024-07-29",
    "author": "SanskaraAI Fashion Desk",
    "excerpt": "From vibrant sarees and lehengas for brides to elegant sherwanis for grooms, navigating the world of Hindu wedding fashion can be exciting. Here are some tips.",
    "image": "/public/placeholder.svg",
    "contentMarkdown": "\n## Dressing for the Occasion: A Guide to Hindu Wedding Fashion\n\nHindu wedding attire is renowned for its opulence, vibrant colors, and intricate details. Choosing the right outfits for the various ceremonies is a significant and exciting part of wedding planning. Here’s a look at some popular choices and tips to help you decide.\n\n### For the Bride\n\n1.  **Saree (साड़ी):**\n    The quintessential Indian garment, a saree is a timeless choice. Bridal sarees are often made of silk (like Kanjeevaram, Banarasi, or Paithani) and are heavily embellished with embroidery, zari work, and stones. The draping style can vary by region. Red is a traditional bridal color, but modern brides are also opting for shades like maroon, pink, gold, and even pastels.\n\n2.  **Lehenga Choli (लहंगा चोली):**\n    A popular choice, especially in North India, the lehenga choli consists of a long, ornate skirt (lehenga), a fitted blouse (choli), and a dupatta (scarf). Bridal lehengas are rich in embroidery, mirror work, and embellishments. They come in a vast array of colors and styles, from traditional reds to contemporary designs.\n\n3.  **Anarkali Suit (अनारकली सूट):**\n    For pre-wedding functions like Sangeet or Mehndi, an Anarkali suit, which is a long, frock-style top paired with slim bottoms, can be an elegant and comfortable option.\n\n**Tips for Brides:**\n*   **Comfort is Key:** You'll be wearing these outfits for long hours. Ensure they are comfortable.\n*   **Consider the Ceremony:** Lighter outfits for pre-wedding events, and heavier, more traditional ones for the main wedding ceremony.\n*   **Accessorize Wisely:** Jewelry plays a huge role. Coordinate your gold, diamond, or Kundan jewelry with your outfits.\n*   **Hairstyle and Makeup:** Plan these in conjunction with your outfit and dupatta setting.\n\n### For the Groom\n\n1.  **Sherwani (शेरवानी):**\n    The most popular choice for grooms, a sherwani is a long, coat-like garment, typically worn over a kurta and churidar or dhoti. Bridal sherwanis are often in shades of gold, cream, maroon, or even pastels, and feature intricate embroidery or brocade work.\n\n2.  **Kurta Pajama/Dhoti (कुर्ता-पजामा/धोती):**\n    For pre-wedding ceremonies or a more understated look, a well-fitted silk or brocade kurta with pajamas or a traditional dhoti can be very elegant. Often paired with a Nehru jacket or a stole.\n\n3.  **Bandhgala Suit (बंधगला सूट):**\n    Also known as a Jodhpuri suit, this is a more formal option, featuring a coat with a closed (bandh) neck (gala). It offers a regal and sophisticated look.\n\n**Tips for Grooms:**\n*   **Coordination:** Consider coordinating your outfit color or elements with the bride's attire.\n*   **Fabric and Fit:** Pay attention to the fabric quality and ensure a perfect fit.\n*   **Accessories:** Safa (turban), mojris (traditional shoes), and a stole can complete the look. A decorative sword (kirpan) is traditional for some communities.\n\nChoosing your wedding attire should be a joyful experience. Start early, do your research, and select outfits that reflect your personal style while honoring tradition.\n",
    "category": "Planning Insights",
    "tags": [
      "Fashion",
      "Attire",
      "Shopping",
      "Bride",
      "Groom"
    ],
    "readTime": "5 min read",
    "calloutTitle": "Need Attire Inspiration?",
    "calloutText": "SanskaraAI's moodboard and vendor matching can help you find the perfect look and connect with designers.",
    "calloutButtonText": "Explore Planning Tools",
    "calloutButtonLink": "/dashboard"
  },
  {
    "slug": "hindu-wedding-rituals",
    "title": "Understanding Key Hindu Wedding Rituals",
    "date": "2024-07-28",
    "author": "SanskaraAI Team",
    "excerpt": "A brief overview of some of the most significant rituals you'll encounter in a Hindu wedding ceremony, from Ganesh Puja to Saptapadi.",
    "image": "/public/placeholder.svg",
    "contentMarkdown": "\n## The Sacred Journey: An Introduction to Hindu Wedding Rituals\n\nHindu weddings are vibrant, elaborate affairs steeped in ancient traditions and rich symbolism. Each ritual carries deep meaning, invoking blessings for the couple's future life together. While customs can vary significantly based on region, community, and family traditions, several core rituals are commonly observed.\n\n### 1. Ganesh Puja (गणेश पूजा)\nMost auspicious Hindu ceremonies begin with an invocation to Lord Ganesha, the remover of obstacles. This prayer seeks his blessings to ensure the wedding proceeds smoothly without any impediments.\n\n### 2. Haldi (हल्दी)\nThe Haldi ceremony is a joyous and colorful pre-wedding ritual where a paste made of turmeric (haldi), sandalwood, oil, and rose water is applied to the bride and groom by their families. Turmeric is known for its beautifying and purifying properties, and the ritual is believed to bless the couple and ward off evil spirits.\n\n### 3. Mehndi (मेहंदी)\nAnother fun pre-wedding event, primarily for the bride, where intricate henna designs are applied to her hands and feet. The depth of the mehndi color is often playfully said to signify the depth of the groom's love. It's a time for celebration, dance, and music.\n\n### 4. Kanyadaan (कन्यादान)\nA poignant and significant ritual where the father of the bride gives her away to the groom. The word 'Kanyadaan' translates to 'gifting a maiden.' It symbolizes the father's blessing and trust in the groom to care for his daughter.\n\n### 5. Mangalsutra & Sindoor (मंगलसूत्र और सिंदूर)\nThe groom ties the Mangalsutra, a sacred necklace of black and gold beads, around the bride's neck. This symbolizes their marital union, love, and commitment. Following this, the groom applies Sindoor (vermilion powder) to the parting of the bride's hair, signifying her status as a married woman.\n\n### 6. Saptapadi (सप्तपदी) - The Seven Steps\nThis is often considered the most important ritual. The bride and groom take seven steps together around a sacred fire (Agni), making seven vows or promises for their married life. Each step represents a specific vow, such as to provide for each other, to grow in strength, to share worldly possessions, and to remain lifelong friends.\n\n### 7. Vidaai (विदाई)\nThe Vidaai is the emotional farewell ceremony where the bride leaves her parental home to start her new life with her husband. It's a bittersweet moment, marking the end of one chapter and the beginning of another.\n\nThese are just a few of the many beautiful rituals that form the tapestry of a Hindu wedding. Each one plays a part in sanctifying the union and preparing the couple for their journey ahead.\n",
    "category": "Wedding Traditions",
    "tags": [
      "Rituals",
      "Ceremony",
      "Tradition",
      "Hinduism"
    ],
    "readTime": "6 min read",
    "calloutTitle": "Planning Your Rituals?",
    "calloutText": "SanskaraAI can help you personalize each ceremony to match your family traditions and preferences. Explore our features!",
    "calloutButtonText": "Discover SanskaraAI Features",
    "calloutButtonLink": "/features"
  },
  {
    "slug": "saptapadi-seven-sacred-steps",
    "title": "Understanding the Saptapadi: The Seven Sacred Steps",
    "date": "2024-07-28",
    "author": "SanskaraAI Team",
    "excerpt": "The Saptapadi, or seven sacred steps, is a cornerstone of Hindu weddings, symbolizing the couple's lifelong journey together. Explore the meaning behind each step.",
    "image": "/public/placeholder.svg",
    "contentMarkdown": "\n## The Heart of the Hindu Wedding: The Saptapadi\n\nThe Saptapadi (Sanskrit: सप्तपदी, *saptapadī*, meaning seven steps) is arguably the most important ritual in a Hindu wedding ceremony. It is the moment when the couple takes seven vows together, walking seven steps around the sacred fire (Agni), which acts as a divine witness to their union. With each step, they make a promise, solidifying their commitment to each other.\n\nThe completion of the Saptapadi legally and religiously solemnizes the marriage. Let's delve into the profound meaning behind each of these seven sacred steps and vows.\n\n### Step 1: The Vow for Nourishment and Provision\n**Mantra (essence):** *May the Divine lead us to provide for each other, to nourish our family, and to respect our food.*\n\nWith the first step, the couple vows to provide for each other and their future family, ensuring they have the resources for a healthy and prosperous life. It emphasizes mutual responsibility in sustaining the household.\n\n### Step 2: The Vow for Strength\n**Mantra (essence):** *May the Divine lead us to grow in physical, mental, and spiritual strength together.*\n\nThe second step is a prayer for strength – not just physical, but also mental fortitude and spiritual well-being. They pledge to support each other in developing these strengths to face life's challenges.\n\n### Step 3: The Vow for Prosperity\n**Mantra (essence):** *May the Divine lead us to increase our wealth through righteous means and to share our prosperity.*\n\nThis vow focuses on acquiring wealth and prosperity through honest and ethical means. It also implies a commitment to manage their finances wisely and to use their resources for good deeds and the welfare of their family and society.\n\n### Step 4: The Vow for Wisdom, Happiness, and Harmony\n**Mantra (essence):** *May the Divine bless us with wisdom, happiness, and harmony in our lives and home.*\n\nThe fourth step is a pledge to cultivate a home filled with joy, peace, and mutual respect. They promise to strive for happiness and to create an environment of understanding and love.\n\n### Step 5: The Vow for Progeny and Family\n**Mantra (essence):** *May the Divine bless us with healthy and virtuous children, and may we be responsible parents.*\n\nWith this step, the couple prays for healthy and noble children. They also take a vow to be loving, responsible, and capable parents, guiding their children on the right path.\n\n### Step 6: The Vow for Health and Longevity\n**Mantra (essence):** *May the Divine bless us with a long life together, filled with good health and free from ailments.*\n\nThe sixth vow is a prayer for a long, healthy life together. They promise to care for each other's well-being and to live in a way that promotes health and longevity through all seasons of life.\n\n### Step 7: The Vow for Friendship and Eternal Companionship\n**Mantra (essence):** *May the Divine lead us to be true companions and to remain lifelong friends, loyal and understanding.*\n\nThe final step solidifies their bond as not just husband and wife, but as lifelong friends and partners. They vow to be loyal, understanding, and supportive of each other, cherishing their companionship for eternity.\n\n---\n\nThe Saptapadi is a beautiful and deeply symbolic ritual that lays the foundation for a strong and meaningful marriage. Understanding these vows can bring even greater significance to this sacred tradition.\n",
    "category": "Traditions",
    "tags": [
      "Rituals",
      "Ceremony",
      "Saptapadi",
      "Hindu Wedding"
    ],
    "readTime": "6 min read",
    "calloutTitle": "Planning Your Own Saptapadi?",
    "calloutText": "SanskaraAI can help you understand and incorporate these beautiful traditions seamlessly into your wedding ceremony. Chat with our AI planner today!",
    "calloutButtonText": "Explore with SanskaraAI",
    "calloutButtonLink": "/dashboard/chat"
  },
  {
    "slug": "choosing-auspicious-dates-panchangam",
    "title": "Choosing Auspicious Dates: The Role of Panchangam",
    "date": "2024-07-25",
    "author": "Pandit Sharma",
    "excerpt": "In Hindu weddings, selecting an auspicious date (Muhurtham) is crucial. Learn how the Panchangam, the Vedic astrological calendar, guides this important decision.",
    "image": "/public/placeholder.svg",
    "contentMarkdown": "\n## The Significance of Time: Muhurtham in Hindu Weddings\n\nOne of the first and most critical steps in planning a Hindu wedding is selecting the **Muhurtham** – an auspicious date and time for the ceremony. This decision is not arbitrary; it is deeply rooted in Vedic astrology and the principles outlined in the **Panchangam**.\n\n### What is the Panchangam?\n\nThe Panchangam (Sanskrit: पञ्चाङ्गम्, *pañcāṅgam*) is the traditional Hindu astrological almanac. The term literally means \"five limbs\" or \"five attributes\" of the day. These five elements are:\n\n1.  **Tithi (Lunar Day):** The phase of the moon. Each lunar month has 30 Tithis. Some Tithis are considered more auspicious for weddings than others.\n2.  **Vara (Day of the Week):** Each day of the week, ruled by a specific planet, carries its own energy.\n3.  **Nakshatra (Lunar Mansion/Star):** The zodiac is divided into 27 Nakshatras. The Nakshatra in which the moon is transiting at the time of the wedding is a key factor. Certain Nakshatras are highly favorable for marriage.\n4.  **Yoga (Luni-Solar Conjunction):** Calculated based on the combined longitudes of the sun and moon, there are 27 Yogas. Some Yogas are auspicious, while others (like Vyatipata or Vaidhriti) are avoided for important events.\n5.  **Karana (Half of a Tithi):** Each Tithi is divided into two Karanas. There are 11 types of Karanas.\n\n### Why is the Panchangam Consulted for Weddings?\n\nIt is believed that performing a wedding ceremony during an astrologically favorable Muhurtham can bring blessings, happiness, prosperity, and longevity to the couple. Conversely, an inauspicious time might attract obstacles or negative influences.\n\nAn experienced astrologer or priest meticulously analyzes the Panchangam, often considering the birth charts (Kundali) of the bride and groom, to determine the most suitable dates and times. This process involves:\n\n*   **Avoiding Inauspicious Periods:** Certain months (like Adhik Maas), Tithis, Nakshatras, and Yogas are generally avoided for weddings. Periods like *Pitru Paksha* (fortnight of ancestors) are also considered unsuitable.\n*   **Considering Planetary Alignments:** The positions and transits of key planets, especially Jupiter (Guru) and Venus (Shukra), which are significators of marriage and happiness, are examined.\n*   **Matching Horoscopes (Kundali Milan):** While not directly part of choosing the Muhurtham itself, horoscope compatibility (Ashta Koota Milan) is often checked beforehand. The Muhurtham is then chosen to further enhance the compatibility.\n*   **Finding Specific Yogas and Lagna:** Astrologers look for specific beneficial Yogas (combinations) and ensure the Lagna (ascendant) at the time of the ceremony is strong and well-placed.\n\n### The Process\n\nTypically, families will consult with their family priest or an astrologer, providing the birth details of the couple. The astrologer will then use the Panchangam to identify several potential auspicious dates and times over a period. The families can then choose a date that is also logistically convenient.\n\nWhile modern couples also consider practical factors like venue availability and guest convenience, the tradition of choosing a Muhurtham through the Panchangam remains a vital aspect of Hindu wedding planning, reflecting a deep respect for cosmic energies and a desire for a blessed start to married life.\n\n---\n\nSanskaraAI aims to bridge tradition with modern convenience. While we always recommend consulting a qualified astrologer for your Muhurtham, our platform can help you understand these traditions better and manage your planning around them.\n",
    "category": "Astrology",
    "tags": [
      "Muhurtham",
      "Panchangam",
      "Hindu Wedding",
      "Planning"
    ],
    "readTime": "5 min read",
    "calloutTitle": "Find Your Perfect Wedding Date!",
    "calloutText": "SanskaraAI can help you connect with astrologers and understand the basics of choosing a Muhurtham for your special day.",
    "calloutButtonText": "Ask SanskaraAI",
    "calloutButtonLink": "/dashboard/chat"
  },
  {
    "slug": "another-post",
    "title": "Another Exciting Post",
    "date": "2024-07-22",
    "author": "AI Assistant",
    "excerpt": "A brief look into another interesting topic.",
    "image": "/public/placeholder.svg",
    "contentMarkdown": "\n## Diving Deeper\n\nThis post explores another fascinating subject. We'll look at various aspects and examples.\n\n### Key Points\n\n1.  **Point One:** Detail about the first key point.\n2.  **Point Two:** Elaboration on the second key point.\n3.  **Point Three:** Further information regarding the third point.\n\n```typescript\nfunction helloWorld() {\n  console.log(\"Hello, world!\");\n}\n```\n\nHope you find this insightful!\n"
  },
  {
    "slug": "my-first-post",
    "title": "My First Blog Post",
    "date": "2024-07-21",
    "author": "Jules Verne",
    "excerpt": "This is a short summary of my first blog post.",
    "image": "/public/placeholder.svg",
    "contentMarkdown": "\n## Welcome to My Blog!\n\nThis is the main content of my **first blog post**. I'm excited to share my thoughts with the world.\n\n### A Subheading\n\nHere's some more text under a subheading. Markdown is pretty cool!\n\n*   List item 1\n*   List item 2\n\nStay tuned for more updates!\n"
  },
  {
    "slug": "modern-haldi-ceremonies",
    "title": "Modern Twists on Traditional Haldi Ceremonies",
    "date": "2024-07-20",
    "author": "Aisha Kapoor",
    "excerpt": "The Haldi ceremony is a vibrant and joyful pre-wedding ritual. Discover how modern couples are adding creative and fun twists to this beautiful tradition.",
    "image": "/public/placeholder.svg",
    "contentMarkdown": "\n## The Radiant Haldi: Tradition Meets Modern Fun\n\nThe Haldi ceremony is one ofthe most fun-filled and visually vibrant pre-wedding rituals in Hindu weddings. Traditionally, a paste made of turmeric (haldi), sandalwood, gram flour, and rose water is applied to the bride and groom by their family and friends. This ritual is believed to purify and beautify the couple before their wedding day, ward off evil spirits, and bestow blessings.\n\nWhile the core essence of the Haldi ceremony remains, modern couples are increasingly infusing it with their personalities and contemporary trends, making it an even more memorable and Instagrammable event!\n\n### Traditional Significance\n\nBefore we dive into modern adaptations, let's appreciate the traditional importance:\n\n*   **Purification:** Turmeric is known for its antiseptic and cleansing properties.\n*   **Beautification:** It imparts a natural glow to the skin.\n*   **Auspiciousness:** The yellow color of turmeric is considered highly auspicious in Hindu traditions.\n*   **Blessings:** The application of Haldi by loved ones is a way of showering blessings upon the couple.\n*   **Relaxation:** The ritual can be a way for the bride and groom to relax and de-stress amidst the wedding preparations.\n\n### Modern Twists and Fun Ideas\n\nHere’s how couples are personalizing their Haldi ceremonies:\n\n1.  **Themed Decor:**\n    *   **Floral Extravaganza:** Think marigold curtains, floral arches, and even floral jewelry for the couple.\n    *   **Bohemian Chic:** Macramé backdrops, pampas grass, and rustic elements.\n    *   **Color Pop:** Moving beyond just yellow, couples are incorporating vibrant color palettes like pinks, oranges, and even teals into the decor.\n\n2.  **Fun with Haldi Application:**\n    *   **Playful Haldi Fights:** Some couples opt for a more relaxed and playful Haldi application, almost like a mini Holi with turmeric paste and flower petals.\n    *   **Creative Applicators:** Using paintbrushes or even water guns (pichkaris) filled with diluted Haldi for a fun twist.\n\n3.  **Attire and Accessories:**\n    *   **Coordinated Outfits:** The bride, groom, and even the wedding party often wear coordinated outfits, typically in shades of yellow, white, or pastels.\n    *   **Floral Jewelry:** Fresh flower jewelry (maang tikka, haath phool, earrings) for the bride is a popular trend.\n    *   **Customized Props:** Fun sunglasses, quirky signboards, and personalized sashes add to the celebratory mood.\n\n4.  **Entertainment and Activities:**\n    *   **Live Music/DJ:** Dhol players, folk singers, or a DJ playing upbeat music can elevate the energy.\n    *   **Dance Performances:** Friends and family often prepare dance performances.\n    *   **Games and Activities:** Incorporating fun games related to the couple or wedding traditions.\n\n5.  **Food and Drinks:**\n    *   **Themed Refreshments:** Yellow-colored drinks (like mango lassi), traditional sweets, and light snacks that complement the festive atmosphere.\n    *   **Chaat Counters:** Live food stations are always a hit.\n\n6.  **Eco-Friendly Haldi:**\n    *   Using organic turmeric and natural ingredients.\n    *   Opting for biodegradable decor and flower petals instead of synthetic materials.\n\n### Keeping the Essence Alive\n\nWhile these modern adaptations add a layer of fun and personalization, it's beautiful to see that the core emotional and traditional significance of the Haldi ceremony – the blessings, the purification, and the joyous gathering of loved ones – remains central.\n\nWhether you opt for a completely traditional Haldi or a more contemporary celebration, the key is to make it a reflection of your joy and the love surrounding your union.\n\n---\n\nSanskaraAI is here to help you plan every ritual, big or small, just the way you envision it!\n",
    "category": "Trends",
    "tags": [
      "Haldi",
      "Pre-Wedding Rituals",
      "Modern Weddings",
      "Hindu Wedding"
    ],
    "readTime": "4 min read",
    "calloutTitle": "Plan Your Dream Haldi!",
    "calloutText": "Looking for ideas to make your Haldi ceremony unique and memorable? SanskaraAI can help you find inspiration and vendors.",
    "calloutButtonText": "Get Haldi Ideas",
    "calloutButtonLink": "/dashboard/chat"
  }
]